@echo off
setlocal enabledelayedexpansion
chcp 65001 >nul
cd /d "%~dp0"
rem Официальная документация разработчиков и открытые баг-трекеры подтверждают: утилита ImageMagick физически не умеет записывать (кодировать) формат DXT3. В её коде встроен кодер только для dxt1, dxt5 и none (несжатый).
rem Когда вы передаете ей команду -define dds:compression=dxt3, ImageMagick не выдает ошибку, а молча включает автоматический откат (fallback) до формата DXT5. Именно поэтому файлы 8a8r8g8b (RGBA) и DXT5, имеющие альфа-канал, принудительно пересчитываются в DXT5. С форматом DXT1 это «сработало» только потому, что для файлов без альфа-канала ImageMagick применяет свой родной кодер DXT1.

:: Создаем папку Out, если её еще нет
if not exist Out mkdir Out

echo Начинаем конвертацию DDS в dxt1 без мип-мапов и альфы...
echo -------------------------------------------------------------------

for %%i in (*.dds) do (
    echo Обработка файла: %%~nxi        
    magick.exe "%%~fi" -type TrueColorAlpha -define dds:compression=dxt3 -define dds:mipmaps=0 "Out\%%~ni.dds"

)

echo -------------------------------------------------------------------
echo Оптимизация завершена! Все легкие DXT1 файлы сохранены в папку Out.
pause