@echo off
setlocal enabledelayedexpansion
chcp 65001 >nul
cd /d "%~dp0"
:: Формат изображения с параметрами 32bit-8a8r8g8b чаще всего называется A8R8G8B8 (или ARGB8888 / ARGB).
:: В контексте разработки игр и работы с DirectX (где формат DDS используется наиболее активно) его официальное техническое название — D3DFMT_A8R8G8B8 (в DirectX 9) или DXGI_FORMAT_B8G8R8A8_UNORM (в более современных версиях DirectX / DXGI).
:: 32-bit (32 бита): Это общий объем памяти на один пиксель.
:: 8a8r8g8b / A8R8G8B8: Показывает порядок цветовых каналов и количество бит, выделенное на каждый из них:
:: A (Alpha / Альфа-канал): 8 бит — отвечает за прозрачность (256 уровней). R (Red / Красный): 8 бит (256 оттенков). G (Green / Зеленый): 8 бит (256 оттенков). B (Blue / Синий): 8 бит (256 оттенков).
:: В отличие от сжатых форматов (таких как DXT1/BC1, DXT5/BC3), этот формат является несжатым (Uncompressed), что обеспечивает максимальное качество изображения без потерь, но увеличивает размер файла.

if not exist Out mkdir Out

echo Начинаем замену ЧЕРНЫХ пикселей на прозрачность и конвертацию в 32bit argb...
echo -------------------------------------------------------------------

for %%i in (*.png) do (
    echo Обработка файла: %%~nxi
    
    :: -transparent black - находит абсолютно черный цвет и делает его прозрачным альфа-каналом. #7f7f7f-серый
    :: -define dds:compression=dxt3 - сжимает в формат DXT3
    :: -define dds:mipmaps=from-alloc - строит полную пирамиду мип-мапов НЕ СТРОИЛА ЗАДАЛ ВРУЧНУЮ
    rem magick.exe "%%~fi" -transparent black -define dds:compression=none -define dds:mipmaps=from-alloc "Out\%%~ni.dds"
    :: Задаем точное количество уровней мипмапов (для 512х512 это 10)
    magick.exe "%%~fi" -transparent black -define dds:compression=none -define dds:mipmaps=10 "Out\%%~ni.dds"
)

echo -------------------------------------------------------------------
echo Конвертация завершена! Все файлы сохранены в папку Out.
pause